app/controllers/users_controller.rb

  def show
    if @user = User.find_by(id: params[:id])
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = 1 LIMIT 1

  def edit
    if @user = User.find_by(id: params[:id])
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = 1 LIMIT 1

  def update
    if @user = User.find_by(id: params[:id])
      @user.update_attributes(first_name: params[:first_name],
                              last_name: params[:last_name],
                              profile_image_url: params[:profile_image_url],
                              height: params[:height],
                              weight: params[:weight],
                              hair_color: params[:hair_color],
                              eye_color: params[:eye_color],
                              skin_color: params[:skin_color],
                              sign: params[:sign],
                              birthday: params[:birthday])
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = 1 LIMIT 1
UPDATE "users" SET "profile_image_url" = $1, "updated_at" = $2 WHERE "users"."id" = 1  [["profile_image_url", "http://cdn.akamai.steamstatic.com/steamcommunity/public/images/avatars/69/69c1ca52afa6e4fb354187708ead9f5a65cde628_full.jpg"], ["updated_at", "2015-08-04 03:05:10.970407"]]